### Explortory Data Analysis Part 1

I want to set up the proper imports so I have access to the Pandas, Matplotlib, and MySQL Connector Python libraries

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import mysql.connector as connection

I want to use MySQL Connector to establish a connection to my remote data source

In [5]:
myremotedb=connection.connect(host="devcodecamp-mysql.c5p7yvjq1h8y.us-east-2.rds.amazonaws.com", database="salesdb", user="root", password="D3v$tudent",use_pure="True")
select_query="Select * from sales"
remote_df= pd.read_sql_query(select_query,myremotedb)
remote_df.head()

C:\Users\rac\AppData\Local\Temp\ipykernel_61656\2575498146.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  remote_df= pd.read_sql_query(select_query,myremotedb)

,Invoice_ID,Customer_Type,Gender,Product_Line,Unit_Price,Quantity,Sales_Tax,Total,Date,Time,Payment,COGS,Gross_Income,Rating,City_ID
0,101-17-6199,Normal,Male,Food and beverages,45.79,7,None,336.5565,3/13/2019,19:44,Credit card,320.53,16.0265,7.0,1
1,101-81-4070,Member,Female,Health and beauty,62.82,2,None,131.9220,1/17/2019,12:36,Ewallet,125.64,6.2820,4.9,3
2,102-06-2002,Member,Male,Sports and travel,25.25,5,None,132.5625,3/20/2019,17:52,Cash,126.25,6.3125,6.1,3
3,102-77-2261,Member,Male,Health and beauty,65.31,7,None,480.0285,3/5/2019,18:02,Credit card,457.17,22.8585,4.2,3
4,105-10-6182,Member,Male,Fashion accessories,21.48,2,None,45.1080,2/27/2019,12:22,Ewallet,42.96,2.1480,6.6,1

 I want to query my database to JOIN the information from the sales and cities tables together, and save the result as a single DataFrame variable.